; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-5-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-1 - location
	p0-6 - location
	p1-0 - location
	p1-2 - location
	p1-6 - location
	p3-6 - location
	p4-0 - location
	p4-3 - location
	p6-2 - location
	p6-4 - location
	p6-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s6)
	(at driver3 s5)
	(at driver4 s0)
	(at driver5 s3)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s3)
	(empty truck5)
	(at package1 s3)
	(at package2 s3)
	(at package3 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 75)
	(= (time-to-walk p0-1 s0) 75)
	(= (time-to-walk s1 p0-1) 40)
	(= (time-to-walk p0-1 s1) 40)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(= (time-to-walk s0 p0-6) 18)
	(= (time-to-walk p0-6 s0) 18)
	(= (time-to-walk s6 p0-6) 1)
	(= (time-to-walk p0-6 s6) 1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 83)
	(= (time-to-walk p1-2 s1) 83)
	(= (time-to-walk s2 p1-2) 78)
	(= (time-to-walk p1-2 s2) 78)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 45)
	(= (time-to-walk p1-6 s1) 45)
	(= (time-to-walk s6 p1-6) 6)
	(= (time-to-walk p1-6 s6) 6)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 12)
	(= (time-to-walk p3-6 s3) 12)
	(= (time-to-walk s6 p3-6) 95)
	(= (time-to-walk p3-6 s6) 95)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 49)
	(= (time-to-walk p4-0 s4) 49)
	(= (time-to-walk s0 p4-0) 64)
	(= (time-to-walk p4-0 s0) 64)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(= (time-to-walk s4 p4-3) 46)
	(= (time-to-walk p4-3 s4) 46)
	(= (time-to-walk s3 p4-3) 62)
	(= (time-to-walk p4-3 s3) 62)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(= (time-to-walk s6 p6-2) 76)
	(= (time-to-walk p6-2 s6) 76)
	(= (time-to-walk s2 p6-2) 38)
	(= (time-to-walk p6-2 s2) 38)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(= (time-to-walk s6 p6-4) 7)
	(= (time-to-walk p6-4 s6) 7)
	(= (time-to-walk s4 p6-4) 97)
	(= (time-to-walk p6-4 s4) 97)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(= (time-to-walk s6 p6-5) 58)
	(= (time-to-walk p6-5 s6) 58)
	(= (time-to-walk s5 p6-5) 59)
	(= (time-to-walk p6-5 s5) 59)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 32)
	(= (time-to-drive s2 s0) 32)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 41)
	(= (time-to-drive s6 s0) 41)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 8)
	(= (time-to-drive s0 s1) 8)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 5)
	(= (time-to-drive s2 s1) 5)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 15)
	(= (time-to-drive s4 s1) 15)
	(link s1 s5)
	(link s5 s1)
	(= (time-to-drive s1 s5) 64)
	(= (time-to-drive s5 s1) 64)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 65)
	(= (time-to-drive s6 s1) 65)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 11)
	(= (time-to-drive s3 s2) 11)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 33)
	(= (time-to-drive s0 s3) 33)
	(link s3 s1)
	(link s1 s3)
	(= (time-to-drive s3 s1) 3)
	(= (time-to-drive s1 s3) 3)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 15)
	(= (time-to-drive s5 s3) 15)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 7)
	(= (time-to-drive s2 s5) 7)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 42)
	(= (time-to-drive s3 s6) 42)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver5 s4)
	(at truck1 s2)
	(at truck2 s3)
	(at truck3 s0)
	(at truck5 s2)
	(at package1 s5)
	(at package2 s4)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 1  (driven))) (* 1  (walked))))

)

; plan
1. (board-truck driver5 truck5 s3)
   deleted: (at driver5 s3) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 1 of 7
2. (load-truck package2 truck5 s3)
   deleted: (at package2 s3)
   added: (in package2 truck5)
   goals met: 1 of 7
3. (load-truck package1 truck5 s3)
   deleted: (at package1 s3)
   added: (in package1 truck5)
   goals met: 1 of 7
4. (drive-truck truck5 s3 s5 driver5)
   deleted: (at truck5 s3)
   added: (at truck5 s5)
   changed: (driven) from 0 to 15
   goals met: 1 of 7
5. (unload-truck package1 truck5 s5)
   deleted: (in package1 truck5)
   added: (at package1 s5)
   goals met: 2 of 7
6. (drive-truck truck5 s5 s1 driver5)
   deleted: (at truck5 s5)
   added: (at truck5 s1)
   changed: (driven) from 15 to 79
   goals met: 2 of 7
7. (board-truck driver1 truck2 s2)
   deleted: (at driver1 s2) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 2 of 7
8. (drive-truck truck2 s2 s3 driver1)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 79 to 90
   goals met: 3 of 7
9. (drive-truck truck5 s1 s4 driver5)
   deleted: (at truck5 s1)
   added: (at truck5 s4)
   changed: (driven) from 90 to 105
   goals met: 3 of 7
10. (unload-truck package2 truck5 s4)
   deleted: (in package2 truck5)
   added: (at package2 s4)
   goals met: 4 of 7
11. (drive-truck truck5 s4 s1 driver5)
   deleted: (at truck5 s4)
   added: (at truck5 s1)
   changed: (driven) from 105 to 120
   goals met: 4 of 7
12. (drive-truck truck5 s1 s2 driver5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (driven) from 120 to 125
   goals met: 5 of 7
13. (drive-truck truck2 s3 s1 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (driven) from 125 to 128
   goals met: 4 of 7
14. (disembark-truck driver1 truck2 s1)
   deleted: (driving driver1 truck2)
   added: (at driver1 s1) (empty truck2)
   goals met: 4 of 7
15. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 7
16. (drive-truck truck1 s1 s2 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   changed: (driven) from 128 to 133
   goals met: 5 of 7
17. (walk driver2 s6 p1-6)
   deleted: (at driver2 s6)
   added: (at driver2 p1-6)
   changed: (walked) from 0 to 6
   goals met: 5 of 7
18. (drive-truck truck5 s2 s1 driver5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   changed: (driven) from 133 to 138
   goals met: 4 of 7
19. (disembark-truck driver5 truck5 s1)
   deleted: (driving driver5 truck5)
   added: (at driver5 s1) (empty truck5)
   goals met: 4 of 7
20. (board-truck driver5 truck2 s1)
   deleted: (at driver5 s1) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 4 of 7
21. (walk driver2 p1-6 s1)
   deleted: (at driver2 p1-6)
   added: (at driver2 s1)
   changed: (walked) from 6 to 51
   goals met: 4 of 7
22. (board-truck driver2 truck5 s1)
   deleted: (at driver2 s1) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 4 of 7
23. (drive-truck truck5 s1 s2 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (driven) from 138 to 143
   goals met: 5 of 7
24. (drive-truck truck2 s1 s3 driver5)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (driven) from 143 to 146
   goals met: 6 of 7
25. (disembark-truck driver5 truck2 s3)
   deleted: (driving driver5 truck2)
   added: (at driver5 s3) (empty truck2)
   goals met: 6 of 7
26. (walk driver5 s3 p4-3)
   deleted: (at driver5 s3)
   added: (at driver5 p4-3)
   changed: (walked) from 51 to 113
   goals met: 6 of 7
27. (walk driver5 p4-3 s4)
   deleted: (at driver5 p4-3)
   added: (at driver5 s4)
   changed: (walked) from 113 to 159
   goals met: 7 of 7
